# Assignment 02 â€“ Beijing 2022 Medals

This notebook merges the **questions** with your **existing solutions (code unchanged)**.

## Creating Data Frame

You are given a fragment of data about medals from the Olympics:

| Country | Gold | Silver | Bronze |
|---|---:|---:|---:|
| NOR | 16 | 8 | 13 |
| GER | 12 | 10 | 5 |
| CHN | 9 | 4 | 2 |

### Setup (imports)

In [4]:
import pandas as pd
import numpy as np

### 1) Create a pandas DataFrame from this data

In [28]:
df_medals = pd.DataFrame({
    "Country": ["NOR","GER","CHN"],
    "Gold": [16, 12, 9],
    "Silver": [8,10,4],
    "Bronze": [13,5,2]
})
df_medals

  Country  Gold  Silver  Bronze
0     NOR    16       8      13
1     GER    12      10       5
2     CHN     9       4       2

### 2) Select the first and third rows and the first and third columns

In [29]:
df_medals.iloc[[0,2],[0,2]]

  Country  Silver
0     NOR       8
2     CHN       4

### (Optional) Select the 3rd row using integer position (your additional step)

In [30]:
df_medals.iloc[2]

Country    CHN
Gold         9
Silver       4
Bronze       2
Name: 2, dtype: object

### 3) Return a data frame that contains just the CHN row

In [32]:
df_medals[df_medals["Country"] == "CHN"]

  Country  Gold  Silver  Bronze
2     CHN     9       4       2

### 4) Return a data frame that contains the medals of Norway and Germany

In [33]:
df_medals[df_medals["Country"].isin(["NOR", "GER"])]

  Country  Gold  Silver  Bronze
0     NOR    16       8      13
1     GER    12      10       5

### 5) Select countries who won ten or more gold medals and return the Country and Gold columns

In [35]:
df_medals.loc[df_medals["Gold"] >= 10, ["Country", "Gold"]]

  Country  Gold
0     NOR    16
1     GER    12

### 6) Sort the medals by bronze (descending)

In [36]:
df_medals.sort_values(by = "Bronze", ascending=False)

  Country  Gold  Silver  Bronze
0     NOR    16       8      13
1     GER    12      10       5
2     CHN     9       4       2

## Read Data Frame

### 1) Read DataFrame from Beijing2022.csv

In [38]:
df_Beiji = pd.read_csv("D://Projects//Python//DataScience//assignment_support//Beijing1.csv", sep=";")
df_Beiji.head(5)

         Country  Gold  Silver  Bronze
0         Norway    16       8      13
1        Germany    12      10       5
2          China     9       4       2
3  United States     8      10       7
4         Sweden     8       5       5

### 2) Compute the total number of medals won for each country and add this as a fifth column

In [48]:
df_Beiji["Total"] = (
    df_Beiji["Gold"] + df_Beiji["Silver"] + df_Beiji["Bronze"]
)
df_Beiji.head(5)

         Country  Gold  Silver  Bronze  Total
0         Norway    16       8      13     37
1        Germany    12      10       5     27
2          China     9       4       2     15
3  United States     8      10       7     25
4         Sweden     8       5       5     18

### 3) Order the rows by the total number of medals won

In [50]:
df_Beiji.sort_values(by="Total").head(5)

    Country  Gold  Silver  Bronze  Total
28   Poland     0       0       1      1
25  Ukraine     0       1       0      1
26  Estonia     0       0       1      1
24    Spain     0       1       0      1
27   Latvia     0       0       1      1

### 4) Sort the data first by total medals (descending) and then by gold medals (descending)

In [55]:
df_Beiji.sort_values(by=["Total","Gold"], ascending=[False, False]).head(5)

          Country  Gold  Silver  Bronze  Total
0          Norway    16       8      13     37
8             ROC     6      12      14     32
1         Germany    12      10       5     27
10         Canada     4       8      14     26
3   United States     8      10       7     25

### 5) Calculate the total number of gold, silver and bronze medals won at Beijing 2022

In [58]:
df_Beiji[["Gold", "Silver", "Bronze"]].sum()

Gold      109
Silver    109
Bronze    109
dtype: int64

### 6) Work out the overall number of medals won by all countries in the Olympic Games in 2022

In [59]:
df_Beiji[["Total"]].sum()

Total    327
dtype: int64